# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:
    
Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
inp = input("Веведите IP сети и маску: ")
parse_input = inp.split("/")
ip = parse_input[0].split(".")
mask = int(parse_input[1])
mask_bin = ("1" * mask + "0" * (32 - mask))
maskb_okt1, maskb_okt2, maskb_okt3, maskb_okt4 = mask_bin[0:8], mask_bin[8:16], mask_bin[16:24], mask_bin[24:32]

template_network = '''
Network:
{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {1:08b}  {2:08b}  {3:08b}

Mask:
/{4}
{5:<10}{6:<10}{7:<10}{8:<10}
{5:08b}  {6:08b}  {7:08b}  {8:08b}
'''
print(template_network.format(int(ip[0]),int(ip[1]),int(ip[2]),int(ip[3]), mask, 
      int(maskb_okt1, 2), int(maskb_okt2, 2), int(maskb_okt3, 2), int(maskb_okt4,2)))